{
  "metadata": {
    "fuente": "Demon Slayer API",
    "url": "https://www.demonslayer-api.com/api/v1/characters",
    "fecha_obtencion": "2025-06-06T03:03:41.521Z",
    "total_personajes": 45,
    "version": "1.0"
  },
  "personajes": [
    {
      "id": 1,
      "name": "Tanjiro Kamado",
      "age": 16,
      "gender": "Masculino",
      "race": "Humano",
      "color": "#22d3ee",
      "description": "Es el protagonista principal de Demon Slayer. Se unió al Cuerpo de Cazadores de Demonios para encontrar una cura que convierta a su hermana, Nezuko Kamado, de vuelta en humana y para cazar y matar demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/1.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "¡Trabajar duro! ¡Todo lo que puedo hacer es trabajar duro! ¡Esa es la historia de mi vida!"
    },
    {
      "id": 2,
      "name": "Nezuko Kamado",
      "age": 14,
      "gender": "Femenino",
      "race": "Demonio",
      "description": "Es un demonio y la hermana menor de Tanjiro Kamado, y uno de los dos miembros restantes de la familia Kamado. Anteriormente humana, fue atacada y transformada en demonio por Muzan Kibutsuji.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/2.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "Los humanos deben ser protegidos y salvados... Nunca los lastimaré.",
      "color": "#f97316"
    },
    {
      "id": 3,
      "name": "Giyu Tomioka",
      "age": 21,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es un Cazador de Demonios del Cuerpo de Cazadores de Demonios y el actual Hashira del Agua. Tiene una personalidad reservada y un sentido muy fuerte de la justicia.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/3.webp",
      "affiliation_id": 2,
      "arc_id": 1,
      "quote": "Siente la rabia. La rabia poderosa y pura de no poder perdonar se convertirá en tu impulso inquebrantable para actuar.",
      "color": "#1e40af"
    },
    {
      "id": 4,
      "name": "Sakonji Urokodaki",
      "age": 70,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Sakonji Urokodaki es un miembro retirado del Cuerpo de Cazadores de Demonios, habiendo ocupado la posición del anterior Hashira del Agua. Es el principal cultivador del estilo de Respiración del Agua, habiendo entrenado a Makomo, Sabito, Giyu Tomioka y Tanjiro Kamado.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/4.webp",
      "affiliation_id": 3,
      "arc_id": 1,
      "quote": "Recuerda respirar profundamente para que el oxígeno fluya a cada célula de tu cuerpo.",
      "color": "#6b7280"
    },
    {
      "id": 5,
      "name": "Sabito",
      "age": 13,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Sabito fue un antiguo aprendiz de Sakonji Urokodaki. Apareció para ayudar a Tanjiro Kamado en sus preparativos para el examen de Selección Final.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/5.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "¡Tienes que asegurarte de nunca olvidar ninguno de los secretos que Urokodaki te enseñó! ¡Grábatelos hasta la médula de tus huesos!",
      "color": "#db2777"
    },
    {
      "id": 6,
      "name": "Makomo",
      "age": 12,
      "gender": "Femenino",
      "race": "Humano",
      "description": "Makomo y Sabito fueron huérfanos de sus respectivas familias y adoptados por Sakonji, quien los entrenó a ambos y les permitió asistir a la Selección Final del Cuerpo de Cazadores de Demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/6.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "Entrena hasta que te mate. Porque realmente, cuando lo analizas, no hay nada más que puedas hacer.",
      "color": "#8b5cf6"
    },
    {
      "id": 7,
      "name": "Hand Demon",
      "age": 47,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "El Demonio de las Manos fue el antagonista principal del Arco de la Selección Final de Demon Slayer. Era un demonio notorio que mató a trece de los aprendices de Sakonji Urokodaki.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/7.webp",
      "affiliation_id": 6,
      "arc_id": 1,
      "quote": "¡He estado aquí tanto tiempo... que las dinastías han surgido y caído! ¡Una y otra vez! ¡Todo mientras he estado atrapado aquí! ¡Imperdonable! ¡Imperdonable!",
      "color": "#374151"
    },
    {
      "id": 8,
      "name": "Genya Shinazugawa",
      "age": 16,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es el hermano menor del Hashira del Viento y como uno de los cinco que sobrevivieron a la Selección Final, Genya posee una base relativamente fuerte como Cazador de Demonios incluso sin utilizar un Estilo de Respiración.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/8.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "Lo haré. Voy a hacerlo. Tengo que hacerlo. Pensar solo en ganar. ¡No permitiré que mi hermano, o mi maestro, o cualquiera de mis camaradas muera!",
      "color": "#059669"
    },
    {
      "id": 9,
      "name": "Zenitsu Agatsuma",
      "age": 16,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Zenitsu Agatsuma es uno de los personajes principales de Demon Slayer y junto con Inosuke Hashibira, un compañero de viaje de Tanjiro Kamado y Nezuko Kamado. También es un Cazador de Demonios en el Cuerpo de Cazadores de Demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/9.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "Me odio más que nadie. Siempre pienso que tengo que poner mi acto en orden, pero termino acobardándome, huyendo, llorando. Quiero cambiar. Quiero ser una persona competente.",
      "color": "#fbbf24"
    },
    {
      "id": 10,
      "name": "Inosuke Hashibira",
      "age": 15,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Inosuke es temperamental, confrontativo, abrasivo y orgulloso. Siempre le gusta pensar que es el luchador más fuerte en una situación, desafiando constantemente a la mayoría de las personas que encuentra y queriendo que otros lo respeten y elogien por su habilidad.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/10.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "Todo lo que muere regresa a la tierra, pero llorar no traerá a ninguno de ellos de vuelta, así que no importa qué tan frustrado te sientas, ¡no llores!",
      "color": "#22c55e"
    },
    {
      "id": 11,
      "name": "Aoi Kanzaki",
      "age": 16,
      "gender": "Femenino",
      "race": "Humano",
      "description": "Aoi Kanzaki es una Cazadora de Demonios del Cuerpo de Cazadores de Demonios. Sin embargo, trabaja como ayudante en la Mansión Mariposa, en lugar de ir a la primera línea y luchar contra demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/11.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "Comparado con ustedes, no soy tan importante, así que no son necesarios los agradecimientos. Sobreviví a la selección por pura suerte. Desde entonces he tenido miedo de luchar, así que soy una cobarde.",
      "color": "#3b82f6"
    },
    {
      "id": 12,
      "name": "Kanao Tsuyuri",
      "age": 16,
      "gender": "Femenino",
      "race": "Humano",
      "description": "Kanao Tsuyuri es la hermana adoptiva de Shinobu y Kanae Kocho. Se volvió incapaz de tomar decisiones por sí misma y tiene una moneda para lanzar y decidir qué camino seguir cuando no sabe qué hacer.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/12.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "De alguna manera siento que las personas que me importan y aquellas importantes para mí seguirán vivas mañana. Pero esa es solo mi esperanza y no hay forma de que pueda prometerlo con certeza.",
      "color": "#a855f7"
    },
    {
      "id": 13,
      "name": "Swamp Demon",
      "age": null,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Es el antagonista principal del Arco del Pantano del Secuestrador. Era un demonio que pasó por una serie de secuestros durante la primera misión de Tanjiro Kamado para el Cuerpo de Cazadores de Demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/13.webp",
      "affiliation_id": 6,
      "arc_id": 2,
      "quote": "¡No interfieras! ¡Arruinarás la frescura de la chica! ¡Se vuelve menos y menos sabrosa con cada momento que pasa!",
      "color": "#4ade80"
    },
    {
      "id": 14,
      "name": "Muzan Kibutsuji",
      "age": 10000,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Muzan Kibutsuji es el antagonista principal de Demon Slayer. Es el Rey Demonio, el progenitor de todos los demás demonios en existencia, y el líder de los Doce Kizuki, una organización compuesta por los doce demonios más fuertes bajo su comando directo.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/14.webp",
      "affiliation_id": 4,
      "arc_id": 2,
      "quote": "Lo único que odio es el 'cambio'. Cambios en las circunstancias. Cambios en el cuerpo. Cambios en la emoción. En la mayoría de los casos, cada cambio es 'degradación'. Es declive. Lo único que me gusta es la 'permanencia'. Si algo no cambia por la eternidad. Está en un estado perfecto.",
      "color": "#dc2626"
    },
    {
      "id": 15,
      "name": "Tamayo",
      "age": 500,
      "gender": "Femenino",
      "race": "Demonio",
      "description": "Tamayo es un demonio gentil, sabio e increíblemente inteligente. Habiendo dedicado la mayor parte de su vida a la investigación de demonios y la transformación humana en uno.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/15.webp",
      "affiliation_id": 1,
      "arc_id": 3,
      "quote": "No necesito ser más fuerte que tú para matarte. Puedo simplemente hacerte más débil. Así como tú harás lo que sea necesario para mantenerte vivo, yo... No, nosotros, haremos lo que sea necesario para matarte.",
      "color": "#8b5cf6"
    },
    {
      "id": 16,
      "name": "Yushiro",
      "age": 35,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Solo se preocupa por Tamayo y odia cuando otros se interponen en su tiempo con ella.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/16.webp",
      "affiliation_id": 1,
      "arc_id": 3,
      "quote": "Alguien que nunca da a otros algún día se volverá incapaz de recibir algo de ellos.",
      "color": "#22c55e"
    },
    {
      "id": 17,
      "name": "Susamaru",
      "age": null,
      "gender": "Femenino",
      "race": "Demonio",
      "description": "Susamaru, también conocida como el Demonio Temari, fue una de las dos antagonistas principales en el Arco de Asakusa de Demon Slayer junto con Yahaba. Era un demonio que fue engañado para creer que era miembro de las Doce Lunas Demoníacas.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/17.webp",
      "affiliation_id": 6,
      "arc_id": 3,
      "quote": "¡Sigamos jugando hasta el amanecer! Hasta que tu vida termine.",
      "color": "#f472b6"
    },
    {
      "id": 18,
      "name": "Yahaba",
      "age": null,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Yahaba, también conocido como el Demonio Flecha, fue uno de los dos antagonistas principales en el Arco de Asakusa de Demon Slayer, junto con Susamaru. Era un demonio que fue engañado para creer que era miembro de las Doce Lunas Demoníacas.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/18.webp",
      "affiliation_id": 6,
      "arc_id": 3,
      "quote": "¿Cómo los mataremos? ¡Brutalmente por supuesto!",
      "color": "#ef4444"
    },
    {
      "id": 19,
      "name": "Kyogai",
      "age": null,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Kyogai era un demonio anteriormente afiliado a las Doce Lunas Demoníacas, habiendo ocupado previamente la posición de Rango Inferior Seis antes de que Muzan Kibutsuji lo excomulgara por alcanzar su límite como demonio y perder su capacidad de volverse más fuerte.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/19.webp",
      "affiliation_id": 4,
      "arc_id": 4,
      "quote": "Los demonios... Existen por una razón.",
      "color": "#d97706"
    },
    {
      "id": 20,
      "name": "Shinobu Kocho",
      "age": 18,
      "gender": "Femenino",
      "race": "Humano",
      "description": "Shinobu es la actual Hashira del Insecto. Después de que un demonio matara a sus padres, se unió al Cuerpo de Cazadores de Demonios para proteger a otros de sufrir el mismo destino que ella.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/20.webp",
      "affiliation_id": 2,
      "arc_id": 5,
      "quote": "Una vez creí que el camino de la felicidad continuaba para siempre y siempre hacia la distancia. Cuando fue destruido, me di cuenta por primera vez de que yace sobre una delgada lámina de vidrio.",
      "color": "#a855f7"
    },
    {
      "id": 21,
      "name": "Murata",
      "age": 21,
      "gender": "Masculino",
      "race": "Humano",
      "description": "No se sabe mucho sobre Murata, sin embargo, no le gusta cuando un cazador de rango inferior lo reprende. Es algo tímido, sin embargo parece más valiente que la mayoría.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/21.webp",
      "affiliation_id": 1,
      "arc_id": 5,
      "quote": "Tomioka recordó mi nombre... ¡Estuvimos juntos desde la Selección Final también...! Sé que hay una gran diferencia entre nosotros pero estuvimos en el mismo grupo, hombre...!",
      "color": "#6b7280"
    },
    {
      "id": 22,
      "name": "Spider Son",
      "age": null,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Era miembro de la Familia Araña, y toma la forma de una araña gigante que posee una cabeza humana. Su rostro, como Madre e Hija, tenía las mismas características faciales de puntos rojos, piel blanca y cabello similar a su 'hermano menor' Rui.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/22.webp",
      "affiliation_id": 5,
      "arc_id": 5,
      "quote": "No hay nada que temer. Cuando el veneno corra por tu sistema y te conviertas en una araña, tu mente se habrá ido.",
      "color": "#1f2937"
    },
    {
      "id": 23,
      "name": "Spider Daughter",
      "age": null,
      "gender": "Femenino",
      "race": "Demonio",
      "description": "Era miembro de la Familia Araña, y se muestra como la más cautelosa dentro de su 'familia', habiendo optado por observar y mantenerse atrás en lugar de saltar directamente a la batalla contra los Cazadores de Demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/23.webp",
      "affiliation_id": 5,
      "arc_id": 5,
      "quote": "Solo me preocupé por mí misma. Eran tontos, pero yo era diferente. ¡Pero ahora he metido la pata!",
      "color": "#374151"
    },
    {
      "id": 24,
      "name": "Spider Mother",
      "age": null,
      "gender": "Femenino",
      "race": "Demonio",
      "description": "Era miembro de la Familia Araña. Como la mayoría de los demonios, Madre era cruel, insensible y asesina hacia los humanos. Controló sin piedad a docenas de Cazadores de Demonios a través de sus hilos y los manipuló para que se mataran entre sí.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/24.webp",
      "affiliation_id": 5,
      "arc_id": 5,
      "quote": "¡Arrgh! ¡Muere! ¡Muere! ¡Muere ahora! ¡Si no lo haces, sufriré un destino terrible!",
      "color": "#4b5563"
    },
    {
      "id": 25,
      "name": "Spider Father",
      "age": null,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Era miembro de la Familia Araña. Físicamente, era el más formidable de su 'familia', poseyendo gran altura y un físico poderosamente construido.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/25.webp",
      "affiliation_id": 5,
      "arc_id": 5,
      "quote": "¡Aléjense... de... mi... familia!",
      "color": "#111827"
    },
    {
      "id": 26,
      "name": "Rui",
      "age": null,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Rui es el líder de la Familia Araña. Fue el antagonista principal en el Arco del Monte Natagumo de Demon Slayer. Era un demonio afiliado a las Doce Lunas Demoníacas, ocupando la posición de Rango Inferior Cinco.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/26.webp",
      "affiliation_id": 5,
      "arc_id": 5,
      "quote": "Como yo era el que tenía más poder, no había nadie que pudiera protegerme... que pudiera escudarme. Mientras más poderoso me volvía, menos recordaba sobre ser humano.",
      "color": "#dc2626"
    },
    {
      "id": 27,
      "name": "Kagaya Ubuyashiki",
      "age": 23,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es el 97º líder del Cuerpo de Cazadores de Demonios conocido principalmente como Oyakata-sama por sus subordinados y pares, y también es el jefe de la Familia Ubuyashiki.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/27.webp",
      "affiliation_id": 1,
      "arc_id": 6,
      "quote": "Sé lo que es la eternidad. La eternidad es el sentimiento humano. Solo los sentimientos humanos duran para siempre y son inmortales.",
      "color": "#6366f1"
    },
    {
      "id": 28,
      "name": "Tengen Uzui",
      "age": 23,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Tengen es el Hashira del Sonido del Cuerpo de Cazadores de Demonios y un combatiente muy poderoso y hábil. Es un individuo excéntrico y llamativo, siempre queriendo ser 'extravagante', poseyendo una necesidad de que todo sea llamativo y sobresaliente.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/28.webp",
      "affiliation_id": 2,
      "arc_id": 6,
      "quote": "¡Soy un dios! ¡Ustedes tres son basura! ¡Esa es la primera cosa que necesitan meterse en sus cabezas! ¡Grábenselo! ¡Van a convertirse en perros si se los digo! ¡Conviértanse en monos si lo digo! ¡Y permítanme repetir! ¡Soy un dios!",
      "color": "#ec4899"
    },
    {
      "id": 29,
      "name": "Mitsuri Kanroji",
      "age": 19,
      "gender": "Femenino",
      "race": "Humano",
      "description": "Mitsuri es la Hashira del Amor del Cuerpo de Cazadores de Demonios. Siempre es amable con otros, sin embargo, a pesar de su actitud gentil y aparentemente inocente, Mitsuri no mostrará piedad ante los demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/29.webp",
      "affiliation_id": 2,
      "arc_id": 6,
      "quote": "¿Está bien que una chica sea tan fuerte? Todavía me preocupo de que alguien pueda preguntar eso, como si no fuera humana. En mi miedo, estaba suprimiendo mi fuerza. Pero ya no más. Déjenme esto a mí. Protegeré a todos.",
      "color": "#f472b6"
    },
    {
      "id": 30,
      "name": "Kyojuro Rengoku",
      "age": 20,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Kyojuro Rengoku, el Hashira de la Llama, posee atributos físicos excepcionales y un espíritu indomable, convirtiéndolo en un guerrero formidable en el Cuerpo de Cazadores de Demonios. Con su increíble resistencia, inmensa resistencia, velocidad, reflejos y habilidades de combate impecables, Rengoku demuestra ser un monstruo en el campo de batalla, superando a sus adversarios y mostrando su dominio de la Respiración de la Llama.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/30.webp",
      "affiliation_id": 2,
      "arc_id": 6,
      "quote": "La vida es una serie de decisiones. Nunca tienes opciones ilimitadas o tiempo ilimitado para pensar, pero lo que eliges en ese instante define quién eres.",
      "color": "#f97316"
    },
    {
      "id": 31,
      "name": "Muichiro Tokito",
      "age": 14,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es el Hashira de la Niebla y a pesar de su personalidad torpe y poco acomodaticia, Muichiro es un prodigio en el Cuerpo de Cazadores de Demonios. Impasible y, a veces, obtuso, tiende a pensar solo en sí mismo y opera solo con lógica.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/31.webp",
      "affiliation_id": 2,
      "arc_id": 6,
      "quote": "Incluso si pierdo mis recuerdos, mi cuerpo recordará esa ira que no me abandonará hasta que muera. Es por eso que entrené tan duro que vomité sangre para destruir demonios. Y más... ¡para erradicarlos!",
      "color": "#06b6d4"
    },
    {
      "id": 32,
      "name": "Gyomei Himejima",
      "age": 27,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es un Cazador de Demonios del Cuerpo de Cazadores de Demonios y el actual Hashira de la Piedra. Gyomei también sirve como mentor de Genya Shinazugawa. Se dice que es el Cazador de Demonios más fuerte en todo el Cuerpo de Cazadores de Demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/32.webp",
      "affiliation_id": 2,
      "arc_id": 6,
      "quote": "Estamos orgullosos de vivir y morir como seres humanos. No actúes como si tus ideas sin valor fueran supremas y las fuerces sobre otros.",
      "color": "#78716c"
    },
    {
      "id": 33,
      "name": "Obanai Iguro",
      "age": 21,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es un Cazador de Demonios del Cuerpo de Cazadores de Demonios y el actual Hashira de la Serpiente. Obanai es un individuo muy duro y estricto que no muestra preocupación por aquellos que no obedecen las reglas del Cuerpo de Cazadores de Demonios.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/33.webp",
      "affiliation_id": 2,
      "arc_id": 6,
      "quote": "Quiero morir derrotando a Muzan, y rezo para que purifique mi sangre sucia. Entonces, si renazco como ser humano en un mundo pacífico sin demonios, te hablaré de mis sentimientos hacia ti.",
      "color": "#7c3aed"
    },
    {
      "id": 34,
      "name": "Sanemi Shinazugawa",
      "age": 21,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es un Cazador de Demonios del Cuerpo de Cazadores de Demonios y el actual Hashira del Viento. Sanemi también es el hermano mayor de Genya Shinazugawa. El comportamiento frío, grosero y desdeñoso de Sanemi es el resultado de perder a demasiadas personas que le importaban en el pasado.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/34.webp",
      "affiliation_id": 2,
      "arc_id": 6,
      "quote": "Sé qué tan injusto es el mundo... porque la gente buena... muere una tras otra.",
      "color": "#10b981"
    },
    {
      "id": 35,
      "name": "Enmu",
      "age": null,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Era un demonio afiliado a las Doce Lunas Demoníacas, ocupando la posición de Rango Inferior Uno. Como Rango Inferior Uno, Enmu era el Rango Inferior más fuerte y el más cercano a igualar la fuerza de las Lunas Demoníacas de Rango Superior.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/35.webp",
      "affiliation_id": 4,
      "arc_id": 6,
      "quote": "Todos los corazones humanos son iguales. Tan frágiles y débiles, como cristalería.",
      "color": "#7c2d12"
    },
    {
      "id": 36,
      "name": "Akaza",
      "age": 133,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Es un demonio afiliado a las Doce Lunas Demoníacas, ocupando la posición de Rango Superior Tres. Como el tercer miembro de mayor rango de las Doce Lunas Demoníacas, Akaza es un demonio excepcionalmente poderoso y el cuarto más fuerte en existencia, después de Doma, Kokushibo y Muzan.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/36.webp",
      "affiliation_id": 4,
      "arc_id": 7,
      "quote": "Te equivocas, Tanjiro. Solo desprecio a los débiles. Solo escupo sobre los débiles. Sí. Los débiles me dan asco.",
      "color": "#ec4899"
    },
    {
      "id": 37,
      "name": "Daki",
      "age": 126,
      "gender": "Femenino",
      "race": "Demonio",
      "description": "Es un demonio afiliado a las Doce Lunas Demoníacas, siendo la portadora secundaria de la posición de Rango Superior Seis, una posición que compartía con el portador principal, su hermano mayor Gyutaro.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/37.webp",
      "affiliation_id": 4,
      "arc_id": 8,
      "quote": "Los demonios nunca envejecen. Y no necesitan dinero para comer. No se enferman. No mueren. No tienen nada que perder. Nosotros, hermosos y poderosos demonios... ¡podemos hacer lo que queramos!",
      "color": "#f59e0b"
    },
    {
      "id": 38,
      "name": "Gyutaro",
      "age": 126,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Como el verdadero Rango Superior Seis, Gyutaro era un demonio extremadamente poderoso con más de un siglo de experiencia de combate bajo su cinturón, habiendo matado y devorado a 15 Hashira en el pasado.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/38.webp",
      "affiliation_id": 4,
      "arc_id": 8,
      "quote": "¡Los sufrimientos de mi pasado fueron lecciones sobre qué hacer a otros como venganza! ¡Si no causo miseria igual a mi propia infelicidad, nunca equilibraré las balanzas!",
      "color": "#22c55e"
    },
    {
      "id": 39,
      "name": "Doma",
      "age": 133,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Es un demonio afiliado a las Doce Lunas Demoníacas, ocupando la segunda posición más alta, Rango Superior Dos. Doma es exteriormente amigable y alegre, poseyendo un aire accesible y carismático.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/39.webp",
      "affiliation_id": 4,
      "arc_id": 8,
      "quote": "Sabes, todos tienen miedo de morir. Y por eso me los como a todos. Ahora pueden vivir conmigo. Para siempre.",
      "color": "#06b6d4"
    },
    {
      "id": 40,
      "name": "Hantengu",
      "age": 200,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Es un demonio afiliado a las Doce Lunas Demoníacas, ocupando la posición de Rango Superior Cuatro. Hantengu parece creer que es completamente inocente a pesar de la evidencia obvia que apunta hacia sus numerosos crímenes.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/40.webp",
      "affiliation_id": 4,
      "arc_id": 9,
      "quote": "Ustedes diablos brutales que atormentan a los débiles... Atroz... Ofensivo... al extremo. Malditos, villanos terribles...",
      "color": "#6b7280"
    },
    {
      "id": 41,
      "name": "Gyokko",
      "age": 133,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Es un demonio afiliado a las Doce Lunas Demoníacas, ocupando la posición de Rango Superior Cinco. Gyokko es un demonio fácilmente excitable, constantemente adulando nuevas inspiraciones para lo que considera su 'arte' o lo que encuentra sublime, a veces incluso yendo en contra de sus impresiones iniciales.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/41.webp",
      "affiliation_id": 4,
      "arc_id": 9,
      "quote": "¡Hyo, hyo! ¡Qué provocación tan infantil! ¿Pensaste que yo, Gyokko, sería derrotado con tal parloteo? Pareces desesperado. Es vergonzoso.",
      "color": "#0d9488"
    },
    {
      "id": 42,
      "name": "Hotaru Haganezuka",
      "age": 37,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es un herrero afiliado al Cuerpo de Cazadores de Demonios. Hotaru es un individuo bastante temperamental. Parece mostrar muy poco cuidado, si es que alguno, sobre cualquier cosa además de las espadas que crea. Su pasión por las espadas es muy fuerte.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/42.webp",
      "affiliation_id": 1,
      "arc_id": 1,
      "quote": "¡No me importa! ¡Eso no importa! ¡Es tu culpa! ¡Es toda tu culpa! ¡La katana se rompió porque eras débil! De otra manera, ¿se habría roto mi katana?! ¡Te voy a matar!",
      "color": "#ea580c"
    },
    {
      "id": 43,
      "name": "Nakime",
      "age": 113,
      "gender": "Femenino",
      "race": "Demonio",
      "description": "Es un demonio que posee y controla el Castillo Infinito y sirve directamente bajo Muzan Kibutsuji. Nakime es distante y taciturna, casi nunca habla y muestra poca o ninguna emoción o voluntad fuera de obedecer órdenes. Era extremadamente leal a Muzan, escuchando y siguiendo cada una de sus órdenes sin falta.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/43.webp",
      "affiliation_id": 4,
      "arc_id": 7,
      "quote": "... Me niego.",
      "color": "#1f2937"
    },
    {
      "id": 44,
      "name": "Kokushibo",
      "age": 480,
      "gender": "Masculino",
      "race": "Demonio",
      "description": "Es un demonio afiliado a las Doce Lunas Demoníacas, ocupando la posición más alta, Rango Superior Uno. Ha luchado contra incontables Cazadores de Demonios y ha acumulado vasta experiencia y conocimiento durante su vida de casi 500 años.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/44.webp",
      "affiliation_id": 4,
      "arc_id": 9,
      "quote": "Abriste un camino... para alcanzar mayores alturas... y lo abandonaste... Tan débil.",
      "color": "#7c2d12"
    },
    {
      "id": 45,
      "name": "Yoriichi",
      "age": 24,
      "gender": "Masculino",
      "race": "Humano",
      "description": "Es un Cazador de Demonios que vivió hace casi 500 años durante la era Sengoku. Era el Cazador de Demonios más poderoso que jamás haya existido.",
      "img": "https://www.demonslayer-api.com/api/v1/characters/images/45.webp",
      "affiliation_id": 1,
      "arc_id": 9,
      "quote": "Mi sueño era vivir una vida tranquila con mi familia en una casa pequeña donde dormiríamos lado a lado. Eso habría sido suficiente. Pero ni siquiera eso se hizo realidad. Los demonios existen en este hermoso mundo.",
      "color": "#fbbf24"
    }
  ]
}